FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/БТ_КонстантныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БТ_КонстантныеЗначения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Поле в котором хранится телефонный номер</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ВерсииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВерсииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВерсииОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВерсийОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПроигнорирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДанныеВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияВладелец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Узел</Name>
					<Comment>Технический реквизит, используется при выгрузке данных в РИБ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизируется</Name>
					<Comment>Технический реквизит, используется при выгрузке данных в РИБ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смещение</Name>
					<Comment>Технический реквизит, используется при выгрузке данных в РИБ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредупреждениеСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/БТ_СопоставлениеПодразделенийChangan.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БТ_СопоставлениеПодразделенийChangan</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрофильПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_ПрофилиПодключенияHTTP</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/CRM_НастройкаПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CRM_НастройкаПодключения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопЗначение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/БТ_СлужебныеФункции/Ext/Module.bsl
// БИЗТЕХ КОВАЛЬ 29.08.2025 ++
Функция ПодменитьПодразделениеДокументаДляПечатиО2(ДокументОбъект) Экспорт 
	
	СсылкаНаДокумент = ДокументОбъект.Ссылка;
	ПодразделениеДляПодмены = Неопределено;
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		
		ПодразделениеДляПодмены = обПолучитьЗначениеСвойства(СсылкаНаДокумент, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("ПодразделениеО2"), Неопределено);
		
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.РеализацияАвтомобилей") И 
		ТипЗнч(СсылкаНаДокумент.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		
		ПодразделениеДляПодмены = обПолучитьЗначениеСвойства(СсылкаНаДокумент.ДокументОснование, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("ПодразделениеО2"), Неопределено);
		
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.СчетФактураВыданный") И
		ТипЗнч(СсылкаНаДокумент.ДокументОснование) = Тип("ДокументСсылка.РеализацияАвтомобилей") И 
		ТипЗнч(СсылкаНаДокумент.ДокументОснование.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаАвтомобиль") Тогда
		
		ПодразделениеДляПодмены = обПолучитьЗначениеСвойства(СсылкаНаДокумент.ДокументОснование.ДокументОснование, ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("ПодразделениеО2"), Неопределено);
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПодразделениеДляПодмены) Тогда 
		//Получаем новый экземпляр обьекта чтобы у нас флаг модификации не взводился
		ДокументОбъектНовый = СсылкаНаДокумент.ПолучитьОбъект();
		ДокументОбъектНовый.ПодразделениеКомпании = ПодразделениеДляПодмены;
		Возврат ДокументОбъектНовый;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьЗначение(Ссылка,Значение) Экспорт
	
	
	
КонецФункции

Процедура БТ_ВыгрузкаВАвтотеку() Экспорт
	
	Обработка = Обработки.ВыгрузкаВАвтодеск.Создать();
	Обработка.НаFTP 		= истина;
	//{{MRG[ <-> ]
	Обработка.КаталогФайла	= "c:\temp\";
	//}}MRG[ <-> ]
	//{{MRG[ <-> ]
	//	Обработка.КаталогФайла = КаталогВременныхФайлов();
	//}}MRG[ <-> ]
	Обработка.ПрифексФайла	= "volvokuban_fkdd";
	//{{MRG[ <-> ]
	Обработка.НачПериода 	= НачалоДня(ТекущаяДата());
	Обработка.КонПериода 	= КонецДня(ТекущаяДата());
	//}}MRG[ <-> ]
	//{{MRG[ <-> ]
	//	Обработка.НачПериода = НачалоДня(ТекущаяДата());
	//	Обработка.КонПериода = КонецДня(ТекущаяДата());
	//}}MRG[ <-> ]
	Обработка.СформироватьФайлПоПродажам();
	Обработка.СформироватьФайлПоРемонтОбслуживаниеАвто();
	Обработка.СформироватьФайлУстановкаДополнительногоОборудования();
	Обработка.СформироватьФайлДиагностика(); 
	
	// БИЗТЕХ КОВАЛЬ ВЫГРУЗКА В АВТО РУ 11.10.2025 ++
	
	Обработка = Обработки.БТ_ВыгрузкаВАвтоRU.Создать();
	
	Обработка.НаЭлПочту 	= Истина;
	Обработка.АдресЭлектроннойПочты 	= "optima@partner-main.autoru.tv";
	Обработка.УчетнаяЗаписьДляОтправки 	= Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("robot_1c@optima-car.ru");
	
	Обработка.КаталогФайла	= "c:\temp\";
	Обработка.ПрифексФайла	= "volvokuban_fkdd";
	Обработка.НачПериода 	= НачалоДня(ТекущаяДата());
	Обработка.КонПериода 	= КонецДня(ТекущаяДата());
	Обработка.СформироватьФайлПоПродажам();
	Обработка.СформироватьФайлПоРемонтОбслуживаниеАвто();
	Обработка.СформироватьФайлУстановкаДополнительногоОборудования();
	Обработка.СформироватьФайлДиагностика();
	//--
	
КонецПроцедуры

Функция ПолучитьКомКоннектор() Экспорт
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если Лев(СистемнаяИнформация.ВерсияПриложения, 3) = "8.3" Тогда
		Возврат Новый COMОбъект("V83.COMConnector");
	Иначе
		Возврат Новый COMОбъект("V82.COMConnector");
	КонецЕсли;
КонецФункции

Процедура ПоставитьОбъектВОчередьНаОбработку(Объект, Вид) Экспорт
	
КонецПроцедуры


Функция ПолучитьЗначенияРеквизитов(Ссылка, ИменаРеквизитов, ВызовПЗР = Ложь) Экспорт
	
	Если Ссылка = Неопределено  Тогда      
		Если Не ВызовПЗР Тогда
			Результат = Новый Структура;
			Ном = 1;
			НомПр =1;
			Пока НомПр <> 0 Цикл 		
				НомПр =  Найти(ИменаРеквизитов," ");
				ИменаРеквизитов =  СтрЗаменить(ИменаРеквизитов," ","");
			КонецЦикла;
			Пока Ном <> 0 Цикл 	
				Ном =  Найти(ИменаРеквизитов,",");
				Если Ном = 0 ТОгда
					Продолжить;
				КонецЕсли;
				Результат.Вставить(Лев(ИменаРеквизитов, Ном-1),Неопределено);
				ИменаРеквизитов =  Прав(ИменаРеквизитов, СтрДлина(ИменаРеквизитов)-Ном);
			КонецЦикла;
			Результат.Вставить(ИменаРеквизитов,Неопределено);
			Возврат Результат;
		Иначе Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	" + ИменаРеквизитов + "
	|ИЗ
	|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Если Найти(ИменаРеквизитов, ".") ИЛИ Найти(ВРег(ИменаРеквизитов), " КАК ") > 0 Тогда		
		Результат = Новый Структура;
		
		Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
			Результат.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);	
			
			Если ВызовПЗР Тогда
				Возврат Выборка[Колонка.Имя];				
			КонецЕсли; 
		КонецЦикла; 		
	Иначе
		Если ВызовПЗР Тогда
			Возврат Выборка[ИменаРеквизитов];
		Иначе
			Результат = Новый Структура(ИменаРеквизитов);	
			ЗаполнитьЗначенияСвойств(Результат, Выборка);			
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции
// 
Функция ПолучитьЗначениеРеквизита(Ссылка, ИмяРеквизита) Экспорт
	
	Возврат ПолучитьЗначенияРеквизитов(Ссылка, ИмяРеквизита, Истина);
	
КонецФункции

Функция НовыйПочтовыйПрофиль() Экспорт 
	
	ПочтовыйПрофиль = Новый ИнтернетПочтовыйПрофиль;
	ПочтовыйПрофиль.АдресСервераSMTP = "smtp.beget.com";
	ПочтовыйПрофиль.ПортSMTP = 25;                                         
	ПочтовыйПрофиль.Пользователь = "1cevent@volvocarkuban.ru";
	ПочтовыйПрофиль.Пароль = "W4D%CvfKKk1s&KOs";                                         
	ПочтовыйПрофиль.ПользовательSMTP = "1cevent@volvocarkuban.ru";
	ПочтовыйПрофиль.ПарольSMTP = "W4D%CvfKKk1s&KOs";
	
	ПочтовыйПрофиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;       
	
	Возврат ПочтовыйПрофиль;
	
КонецФункции


Функция ОтправитьЭлПисьмо(Тема, ТекстПисьма, Получатели) Экспорт
	
	ПочтовыйПрофиль = НовыйПочтовыйПрофиль();
	
	Почта = Новый ИнтернетПочта;
	
	Попытка
		Почта.Подключиться(ПочтовыйПрофиль);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Письмо 					= Новый ИнтернетПочтовоеСообщение;
	Письмо.Тексты.Добавить(ТекстПисьма, ТипТекстаПочтовогоСообщения.HTML);
	Письмо.Тема 			= Тема; 
	Письмо.Отправитель 		= "1cevent@volvocarkuban.ru";
	Письмо.ИмяОтправителя 	= "1cevent";   
	
	АдрессЭлектроннойПочтыПодмена = РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("АдрессЭлектроннойПочтыПодмена");
	
	Если АдрессЭлектроннойПочтыПодмена = Неопределено Тогда
		
		для каждого стр из Получатели цикл   
			Письмо.Получатели.Добавить(Стр.Значение);
		КонецЦикла;	           
		
	Иначе
		
		Письмо.Получатели.Добавить(АдрессЭлектроннойПочтыПодмена);
		
	КонецЕсли;
	
	
	Попытка
		РезультатОтправки = Почта.Послать(Письмо);
	Исключение
		//Сообщить("Не удалось подключиться к серверу");
		//Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Почта.Отключиться();
КонецФункции

Функция УзнатьЭлектроннуюПочту(Сотрудники) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление КАК ЭлектронныйАдресс,
	|	КонтактнаяИнформация.Объект КАК Сотрудник
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект в (&Сотрудники)";    
	
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции     

//Функция ПолучитьНастройкиОтчета(ЗН = Неопределено)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Значение,
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Значение1,
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных1.Значение КАК Значение2
//		|ИЗ
//		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных1
//		|		ПО БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 = БТ_СписокКонстантныхЗначенийТаблицаДанных1.Ссылка
//		|ГДЕ
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ОтчетПоВизитам_АвтоматическаяНастройка""
//		|ИТОГИ ПО
//		|	Значение";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаЗначение = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	
//	СтруктураОтчета = Новый Структура;
//	
//	Пока ВыборкаЗначение.Следующий() Цикл
//		// Вставить обработку выборки ВыборкаЗначение
//	
//		ВыборкаДетальныеЗаписи = ВыборкаЗначение.Выбрать();
//		
//		Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
//			
//			Результат = Новый СписокЗначений;
//			                 
//		Иначе
//			
//			Результат = Неопределено;
//		
//		КонецЕсли;
//			
//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//			
//			Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
//				
//				Результат.Добавить(ВыборкаДетальныеЗаписи.Значение2);
//				
//			Иначе
//				
//				Результат = ВыборкаДетальныеЗаписи.Значение1;
//				
//			КонецЕсли;
//			
//		КонецЦикла;               
//		
//		Если Нрег(ВыборкаЗначение.Значение) = "модель" Тогда
//			
//			Результат = Справочники.Модели.НайтиПоКоду(Результат);
//			
//		КонецЕсли;
//		
//		СтруктураОтчета.Вставить(ВыборкаЗначение.Значение, Результат);
//		
//	КонецЦикла;          
//	
//	СтруктураОтчета.Вставить("ПутьФайла", РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ОтчетПоВизитам_АвтоматическаяНастройка_ПутьФайла"));
//	
//	ПериодВыгрузки = Новый СтандартныйПериод();                   
//	
//	// 86400 - Это сутки 
//	// 86400 * 7 - Это Неделя      
//	
//	Если ЗН = Неопределено Тогда
//	
//		ПериодВыгрузки.ДатаНачала = НачалоДня(ТекущаяДата()) - 86400; 
//		ПериодВыгрузки.ДатаОкончания = КонецДня(ТекущаяДата());
//		
//	Иначе
//		
//		ПериодВыгрузки.ДатаОкончания = КонецГода(ТекущаяДата());
//		
//		СтруктураОтчета.Вставить("Ссылка", ЗН);
//	КонецЕсли;
//	
//	СтруктураОтчета.Вставить("ПериодВыгрузки", ПериодВыгрузки);
//	Возврат СтруктураОтчета;
//	
//КонецФункции

//Процедура БТ_ВыгрузкаДанныхОтчетаПоВизитам(ЗН = Неопределено) Экспорт
//	
//	СтруктураОтчета = ПолучитьНастройкиОтчета();      
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Значение,
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Значение1,
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение2 КАК Значение2
//		|ИЗ
//		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
//		|ГДЕ
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ОтчетПоВизитам_ВыгрузкаПоЦехам""";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		
//		СтруктураОтчета.Вставить("Цех", ВыборкаДетальныеЗаписи.Значение);
//		СтруктураОтчета.Вставить("ПутьФайла", ВыборкаДетальныеЗаписи.Значение1);  
//		
//		Если не ВыборкаДетальныеЗаписи.Значение2 = NULL Тогда
//			
//			СтруктураОтчета.Вставить("Подразделение", ВыборкаДетальныеЗаписи.Значение2);
//			
//		КонецЕсли;

//	
//		ОтчетПоВизитам = Отчеты.БТ_ОтчетПоВизитам.Создать();
//		ОтчетПоВизитам.ВыгрузитьВФайл(, СтруктураОтчета);  
//		
//	КонецЦикла;
//	
//	НастройкиВыгрузкиСкладов = ПолучитьДанныеДляВыгрузкиСкладов();
//	
//	ВыборкаПутьВыгрузки = НастройкиВыгрузкиСкладов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	
//	Пока ВыборкаПутьВыгрузки.Следующий() Цикл  
//		
//		ВыборкаДетальныеЗаписи = ВыборкаПутьВыгрузки.Выбрать(); 
//		
//		ФайлВыгрузки = ВыгрузитьСклады(СтруктураОтчета, ВыборкаДетальныеЗаписи);
//		
//		Отчеты.БТ_ОтчетПоВизитам.ВыгрузитьCSV(ФайлВыгрузки, ВыборкаПутьВыгрузки.ПутьВыгрузки + "File3.txt",0);
//		
//	КонецЦикла;

//	
//КонецПроцедуры

//Функция ПолучитьДанныеДляВыгрузкиСкладов()

//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	БТ_СписокКонстантныхЗначенийНастройкаСкладов.Значение КАК Склад,
//		|	БТ_СписокКонстантныхЗначенийНастройкаСкладов.Значение1 КАК Поздразделение,
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК ПутьВыгрузки
//		|ИЗ
//		|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийНастройкаСкладов
//		|		ПО БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 = БТ_СписокКонстантныхЗначенийНастройкаСкладов.Ссылка
//		|ГДЕ
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ОтчетПоВизитам_ВыгрузкаПоСкладам""
//		|ИТОГИ ПО
//		|	ПутьВыгрузки";
//	
//	РезультатЗапроса = Запрос.Выполнить(); 
//	
//	Возврат РезультатЗапроса;
//	
//КонецФункции

//Функция ВыгрузитьСклады(СтруктураОтчета, Отборы)
//	
//	СКД = Отчеты.БТ_ОтчетПоВизитам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").ВложенныеСхемыКомпоновкиДанных.Найти("РасшифровкаОстаков").Схема;
//	
//	НастройкиВарианта = СКД.НастройкиПоУмолчанию;
//	Отбор           = НастройкиВарианта.Отбор;
//	СтруктураОтчета = НастройкиВарианта.Структура;
//	Показатели      = НастройкиВарианта.Выбор;     
//	
//		//ПериодИзОтчета 		= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение;   
//		//КодДилера			= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[5].Значение;
//		//Марка				= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[6].Значение;
//		//СкладКомпанииВСписке = Неопределено;
//		//НаименованиеДилера 	= "";
//		//
//		//Для Каждого ТекЭлемент из КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы Цикл 
//		//	
//		//	Если Не ТекЭлемент.Использование Тогда
//		//		
//		//		Продолжить;
//		//		
//		//	КонецЕсли;
//		//	
//		//	Если Строка(ТекЭлемент.Параметр) = "КодДилера3" Тогда
//		//		
//		//		КодДилера 		= ТекЭлемент.Значение;	
//		//		
//		//	ИначеЕсли Строка(ТекЭлемент.Параметр) = "Марка3" Тогда      
//		//		
//		//		Марка			= ТекЭлемент.Значение;	
//		//		
//		//	ИначеЕсли Строка(ТекЭлемент.Параметр) = "Период_" Тогда      
//		//		
//		//		ПериодИзОтчета	= ТекЭлемент.Значение;	
//		//		
//		//	ИначеЕсли Строка(ТекЭлемент.Параметр) = "СкладКомпанииВСписке" Тогда      
//		//		
//		//		СкладКомпанииВСписке	= ТекЭлемент.Значение;	
//		//		
//		//	ИначеЕсли Строка(ТекЭлемент.Параметр) = "НаименованиеДилера" Тогда      
//		//		
//		//		НаименованиеДилера	= ТекЭлемент.Значение;
//		//		
//		//	КонецЕсли;
//		//	
//		//КонецЦикла;
//		//ТекОтборы 			= КомпоновщикНастроек.Настройки.Отбор.Элементы; 
//		//
//		//Если СтруктураОтбора = Неопределено Тогда
//		//
//		//	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("КонПериода",			ПериодИзОтчета.ДатаОкончания);
//		//	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("КодДилера3",			КодДилера);                     
//		//	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеДилера",	НаименованиеДилера);
//		//	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦен",				Справочники.ТипыЦен.НайтиПоКоду("00002"));
//		//	
//		//Иначе
//			
//		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("КонПериода",	КонецГода(ТекущаяДата()));
//		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("КодДилера3",			"ООО «Темп  Авто ФКДД»");
//		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеДилера",	"2340200");
//		НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦен",		Справочники.ТипыЦен.НайтиПоКоду("00002"));
//	
//		ГруппаОтбора = Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
//		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
//		
//		
//		Пока Отборы.Следующий() Цикл
//			
//			ГруппаОтбораИ = ГруппаОтбора.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
//			ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
//		
//			ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВИерархии;
//			ЭлементОтбора.Использование	 	= Истина;
//			ЭлементОтбора.ЛевоеЗначение	 	= Новый ПолеКомпоновкиДанных("СкладКомпании");
//			ЭлементОтбора.ПравоеЗначение	= Отборы.Склад;
//		
//			ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВИерархии;
//			ЭлементОтбора.Использование	 	= Истина;
//			ЭлементОтбора.ЛевоеЗначение	 	= Новый ПолеКомпоновкиДанных("Подразделение");
//			ЭлементОтбора.ПравоеЗначение	= Отборы.Поздразделение;     
//			
//			
//		
//			ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВИерархии;
//			ЭлементОтбора.Использование	 	= Истина;
//			ЭлементОтбора.ЛевоеЗначение	 	= Новый ПолеКомпоновкиДанных("Подразделение");
//			ЭлементОтбора.ПравоеЗначение	= Отборы.Поздразделение;
//			
//		КонецЦикла;

//				
//		//КонецЕсли;
//		//
//		//Для каждого ТекОтбор из ТекОтборы Цикл   
//		//	
//		//	Если ТекОтбор.Использование и ТекОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение") Тогда
//		//	
//		//		ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//		//	 	ЗаполнитьЗначенияСвойств(ЭлементОтбора, ТекОтбор);             
//		//		
//		//	КонецЕсли;
//		//	
//		//КонецЦикла;  
//	
//	
//	ТабДокОтчет = Новый ТабличныйДокумент;
//	МакетКомпоновки = Новый КомпоновщикМакетаКомпоновкиДанных;
//	Макет = МакетКомпоновки.Выполнить(СКД, НастройкиВарианта,);
//	ПроцессорКомпоновки = новый ПроцессорКомпоновкиДанных;
//	ПроцессорКомпоновки.Инициализировать(Макет,,,Истина);
//	ТабличныйДокументРезультата = Новый ТабличныйДокумент;
//	
//	// Получение результата
//	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый 
//	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
//	
//	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ТабличныйДокументРезультата);
//	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновки);          
//	
//	//Возврат ТабличныйДокументРезультата;
//	
//	КомпоновщикНастроекТЗ = Новый КомпоновщикНастроекКомпоновкиДанных;
//	КомпоновщикНастроекТЗ.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
//	КомпоновщикНастроекТЗ.ЗагрузитьНастройки(НастройкиВарианта);
//	НастройкиКомпоновщика = КомпоновщикНастроекТЗ.Настройки;
//	
//	МакетКомпоновки = Новый КомпоновщикМакетаКомпоновкиДанных; 
//	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
//	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
//	Процессор = Новый ПроцессорКомпоновкиДанных;
//	Процессор.Инициализировать(МакетКомпоновкиДанных);
//	ТЗ = Новый ТаблицаЗначений;
//	ТЗ.Очистить();
//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
//	ПроцессорВывода.УстановитьОбъект(ТЗ);
//	ПроцессорВывода.Вывести(Процессор);
//	
//	Возврат ТЗ;
//	
//КонецФункции

Функция ПолучитьНайстрокуПоЗН(ЗН) Экспорт 
	
	СтруктураОтчета = Новый Структура;
	
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Ссылка", ЗН);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка КАК Ссылка,
	|	ЗаказНаряд.Цех КАК Цех,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК ЦехИзНастроек,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Марка,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение2 КАК КодДилера,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение3 КАК ПутьВыгрузкиЗН
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	|		ПО ЗаказНаряд.Цех = БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение
	|			И (ЗаказНаряд.Автомобиль.БТ_МаркаАвто = БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1)
	|ГДЕ
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ОтчетПоВизитам_ЗН_Настройки""
	|	И ЗаказНаряд.Ссылка = &Ссылка";
	
	если типзнч(зн) = ТипЗнч(документы.БТ_ЗаказНарядЛайт.ПустаяСсылка()) Тогда 
		запрос.Текст = СтрЗаменить(запрос.Текст, "ЗаказНаряд", "БТ_ЗаказНарядЛайт");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураОтчета.Вставить("ПутьФайлаЗН", 	РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ОтчетПоВизитам_АвтоматическаяНастройка_ПутьФайлаЗН"));
		СтруктураОтчета.Вставить("Марка", 			ВыборкаДетальныеЗаписи.Марка);
		СтруктураОтчета.Вставить("КодДилера", 		ВыборкаДетальныеЗаписи.КодДилера);
		СтруктураОтчета.Вставить("ПутьФайлаЗН", 	ВыборкаДетальныеЗаписи.ПутьВыгрузкиЗН);
		СтруктураОтчета.Вставить("ПутьФайла", 		ВыборкаДетальныеЗаписи.ПутьВыгрузкиЗН);
	КонецЦикла; 
	
	ПериодВыгрузки = Новый СтандартныйПериод(); 
	ПериодВыгрузки.ДатаНачала		= НачалоГода(ТекущаяДата());
	ПериодВыгрузки.ДатаОкончания	= КонецГода(ТекущаяДата());
	СтруктураОтчета.Вставить("Ссылка", ЗН);
	
	СтруктураОтчета.Вставить("ПериодВыгрузки", ПериодВыгрузки); 
	
	Возврат СтруктураОтчета;
	
КонецФункции


Функция ПолучитьНастройкиОтчета(ЗН, Название) Экспорт 
	
	Если Не ЗН = Неопределено Тогда
		
		Возврат ПолучитьНайстрокуПоЗН(ЗН);
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Значение,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Значение1,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных1.Значение КАК Значение2
	|ИЗ
	|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных1
	|		ПО БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 = БТ_СписокКонстантныхЗначенийТаблицаДанных1.Ссылка
	|ГДЕ
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = &Название
	|ИТОГИ ПО
	|	Значение";                        
	
	Запрос.УстановитьПараметр("Название", Название);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗначение = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	СтруктураОтчета = Новый Структура;
	
	Пока ВыборкаЗначение.Следующий() Цикл
		// Вставить обработку выборки ВыборкаЗначение
		
		ВыборкаДетальныеЗаписи = ВыборкаЗначение.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
			
			Результат = Новый СписокЗначений;
			
		Иначе
			
			Результат = Неопределено;
			
		КонецЕсли;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.Количество() > 1 Тогда
				
				Результат.Добавить(ВыборкаДетальныеЗаписи.Значение2);
				
			Иначе
				Если ТипЗнч(ВыборкаДетальныеЗаписи.Значение1) = Тип("СправочникСсылка.Организации") Тогда
					Результат = ВыборкаДетальныеЗаписи.Значение1;
				Иначе
					Результат = Строка(ВыборкаДетальныеЗаписи.Значение1);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;               
		
		Если Нрег(ВыборкаЗначение.Значение) = "модель" Тогда
			
			Результат = Справочники.Модели.НайтиПоКоду(Результат);
			
		КонецЕсли;
		
		СтруктураОтчета.Вставить(ВыборкаЗначение.Значение, Результат);
		
	КонецЦикла;          
	
	СтруктураОтчета.Вставить("ПутьФайлаЗН", РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ОтчетПоВизитам_АвтоматическаяНастройка_ПутьФайлаЗН"));
	СтруктураОтчета.Вставить("ПутьФайла", РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ОтчетПоВизитам_АвтоматическаяНастройка_ПутьФайла"));
	
	ПериодВыгрузки = Новый СтандартныйПериод();                   
	
	// 86400 - Это сутки 
	// 86400 * 7 - Это Неделя      
	
	
	Если ЗН = Неопределено Тогда
		
		ПериодВыгрузки.ДатаНачала = НачалоДня(ТекущаяДата()) - 86400; 
		ПериодВыгрузки.ДатаОкончания = КонецДня(ТекущаяДата());
		
	Иначе
		
		ПериодВыгрузки.ДатаНачала		= НачалоГода(ТекущаяДата());
		ПериодВыгрузки.ДатаОкончания	= КонецГода(ТекущаяДата());
		СтруктураОтчета.Вставить("Ссылка", ЗН);
		СтруктураОтчета.Удалить("Модель");
		СтруктураОтчета.Удалить("ВидРемонта");
		СтруктураОтчета.Удалить("Организация");
		
	КонецЕсли;
	
	
	СтруктураОтчета.Вставить("ПериодВыгрузки", ПериодВыгрузки);
	Возврат СтруктураОтчета;
	
КонецФункции

Процедура БТ_ВыгрузкаДанныхОтчетаПоВизитам(ЗН = Неопределено, Возвращаемое = Неопределено) Экспорт
	
	//СтруктураОтчета = ПолучитьНастройкиОтчета();      
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК Значение,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Значение1,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение2 КАК Значение2
	|ИЗ
	|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	|ГДЕ
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ОтчетПоВизитам_ВыгрузкаПоЦехам""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл       
		
		СтруктураОтчета = ПолучитьНастройкиОтчета(ЗН, ВыборкаДетальныеЗаписи.Значение2); 
		
		СтруктураОтчета.Вставить("ПутьФайла", ВыборкаДетальныеЗаписи.Значение1);  
		
		Если ЗН = Неопределено Тогда
			
			СтруктураОтчета.Вставить("Цех", ВыборкаДетальныеЗаписи.Значение);   
			
		ИначеЕсли Не СтруктураОтчета.Свойство("КодДилера") Тогда
			
			Сообщить("Не найдены настройки для выгрузки по данному ЗН, выгрузки данных не будет");
			Возврат;
			
		КонецЕсли;
		
		этоЛайт = ТипЗнч(ЗН) = ТипЗнч(документы.БТ_ЗаказНарядЛайт.ПустаяСсылка());
		Если этоЛайт Тогда 
			ОтчетПоВизитам = Отчеты.БТ_ОтчетПоВизитамЛайт.Создать(); 
			
		Иначе	
			ОтчетПоВизитам = Отчеты.БТ_ОтчетПоВизитам.Создать(); 
		КонецЕсли;	
		Рез = ОтчетПоВизитам.ВыгрузитьВФайл(этоЛайт, СтруктураОтчета);   
		
		Если Не ЗН = Неопределено Тогда
			
			Возвращаемое = Новый структура("Результат, СтруктураОтбора", Рез, СтруктураОтчета);
			
			Возврат;
			
		КонецЕсли;
		
		
	КонецЦикла;             
	
	Если Не ЗН = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	НастройкиВыгрузкиСкладов = ПолучитьДанныеДляВыгрузкиСкладов();
	
	ВыборкаПутьНазвание = НастройкиВыгрузкиСкладов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПутьНазвание.Следующий() Цикл     
		
		ВыборкаПутьВыгрузки = ВыборкаПутьНазвание.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаПутьВыгрузки.Следующий();     
		
		СтруктураОтчета = ПолучитьНастройкиОтчета(ЗН, ВыборкаПутьВыгрузки.Название); 
		
		ВыборкаДетальныеЗаписи = ВыборкаПутьВыгрузки.Выбрать(); 
		
		ФайлВыгрузки = ВыгрузитьСклады(СтруктураОтчета, ВыборкаДетальныеЗаписи);
		
		Отчеты.БТ_ОтчетПоВизитам.ВыгрузитьCSV(ФайлВыгрузки, ВыборкаПутьВыгрузки.ПутьВыгрузки + "File3.txt",0);
		
	КонецЦикла;      
	
	
	ЗадержкаСекунд = 10;
	
	КомандаWindows = "Timeout /T " + Формат(ЗадержкаСекунд, "ЧГ=0") + " /NoBreak";
	WshShell = Новый COMОбъект("WScript.Shell"); 
	WshShell.Run(КомандаWindows, 0, -1);
	
	Запрос = Новый Запрос;   
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаряд.Ссылка КАК Ссылка,
	|	ЗаказНаряд.Цех КАК Цех,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК ЦехИзНастроек,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Марка,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение2 КАК КодДилера,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение3 КАК ПутьВыгрузкиЗН,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение4 КАК ПутьОбработки
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	|		ПО ЗаказНаряд.Цех = БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение
	|ГДЕ
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ОтчетПоВизитам_ЗН_Настройки""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		
		Если Не ПустаяСтрока(ВыборкаДетальныеЗаписи.ПутьОбработки) Тогда
			
			//	ЗапуститьПриложение(ВыборкаДетальныеЗаписи.ПутьОбработки);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеДляВыгрузкиСкладов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БТ_СписокКонстантныхЗначенийНастройкаСкладов.Значение КАК Склад,
	|	БТ_СписокКонстантныхЗначенийНастройкаСкладов.Значение1 КАК Поздразделение,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК ПутьВыгрузки,
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение2 КАК Название
	|ИЗ
	|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийНастройкаСкладов
	|		ПО БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 = БТ_СписокКонстантныхЗначенийНастройкаСкладов.Ссылка
	|ГДЕ
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ОтчетПоВизитам_ВыгрузкаПоСкладам""
	|ИТОГИ ПО
	|	ПутьВыгрузки,
	|	Название";
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ВыгрузитьСклады(СтруктураОтчета_Отборы, Отборы)  Экспорт
	
	СКД = Отчеты.БТ_ОтчетПоВизитам.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных").ВложенныеСхемыКомпоновкиДанных.Найти("РасшифровкаОстаков").Схема;
	
	НастройкиВарианта = СКД.НастройкиПоУмолчанию;
	Отбор           = НастройкиВарианта.Отбор;
	СтруктураОтчета = НастройкиВарианта.Структура;
	Показатели      = НастройкиВарианта.Выбор;     
	
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("КонПериода",	КонецГода(ТекущаяДата()));
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("КодДилера3",	?(СтруктураОтчета_Отборы.Свойство("Организация"), Строка(СтруктураОтчета_Отборы.Организация), "ООО «Темп  Авто ФКДД»"));
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("НаименованиеДилера",	?(СтруктураОтчета_Отборы.Свойство("КодДилера"), Строка(СтруктураОтчета_Отборы.КодДилера), "2340200"));//"2340200");
	НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦен",		Справочники.ТипыЦен.НайтиПоКоду("00002"));
	
	ГруппаОтбора = Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	
	Пока Отборы.Следующий() Цикл
		
		ГруппаОтбораИ = ГруппаОтбора.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВИерархии;
		ЭлементОтбора.Использование	 	= Истина;
		ЭлементОтбора.ЛевоеЗначение	 	= Новый ПолеКомпоновкиДанных("СкладКомпании");
		ЭлементОтбора.ПравоеЗначение	= Отборы.Склад;
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВИерархии;
		ЭлементОтбора.Использование	 	= Истина;
		ЭлементОтбора.ЛевоеЗначение	 	= Новый ПолеКомпоновкиДанных("Подразделение");
		ЭлементОтбора.ПравоеЗначение	= Отборы.Поздразделение;     
		
		
		
		ЭлементОтбора = ГруппаОтбораИ.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВИерархии;
		ЭлементОтбора.Использование	 	= Истина;
		ЭлементОтбора.ЛевоеЗначение	 	= Новый ПолеКомпоновкиДанных("Подразделение");
		ЭлементОтбора.ПравоеЗначение	= Отборы.Поздразделение;
		
	КонецЦикла;       
	
	Если СтруктураОтчета_Отборы.Свойство("Номенклатура") и ЗначениеЗаполнено(СтруктураОтчета_Отборы.Номенклатура) Тогда
		
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВИерархии;
		ЭлементОтбора.Использование	 	= Истина;
		ЭлементОтбора.ЛевоеЗначение	 	= Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбора.ПравоеЗначение	= Справочники.Номенклатура.НайтиПоКоду(СтруктураОтчета_Отборы.Номенклатура);
		
	КонецЕсли;
	
	
	//КонецЕсли;
	//
	//Для каждого ТекОтбор из ТекОтборы Цикл   
	//	
	//	Если ТекОтбор.Использование и ТекОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение") Тогда
	//	
	//		ЭлементОтбора = Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	 	ЗаполнитьЗначенияСвойств(ЭлементОтбора, ТекОтбор);             
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;  
	
	
	ТабДокОтчет = Новый ТабличныйДокумент;
	МакетКомпоновки = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = МакетКомпоновки.Выполнить(СКД, НастройкиВарианта,);
	ПроцессорКомпоновки = новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,,,Истина);
	ТабличныйДокументРезультата = Новый ТабличныйДокумент;
	
	// Получение результата
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый 
	ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ТабличныйДокументРезультата);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновки);          
	
	//Возврат ТабличныйДокументРезультата;
	
	КомпоновщикНастроекТЗ = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекТЗ.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	КомпоновщикНастроекТЗ.ЗагрузитьНастройки(НастройкиВарианта);
	НастройкиКомпоновщика = КомпоновщикНастроекТЗ.Настройки;
	
	МакетКомпоновки = Новый КомпоновщикМакетаКомпоновкиДанных; 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	Процессор = Новый ПроцессорКомпоновкиДанных;
	Процессор.Инициализировать(МакетКомпоновкиДанных);
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(Процессор);
	
	Возврат ТЗ;
	
КонецФункции

Процедура РегламентноеЗадание1() Экспорт
	
	Версионализации_ПериодИспользованияДней = РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("Версионализации_ПериодИспользованияДней");
	
	Если Версионализации_ПериодИспользованияДней = Неопределено или
		ТипЗнч(Версионализации_ПериодИспользованияДней) <> Тип("Число") Тогда
		
		Версионализации_ПериодИспользованияДней = 30;
		
	КонецЕсли;    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВерсииОбъектов.Объект КАК Объект,
	|	ВерсииОбъектов.НомерВерсии КАК НомерВерсии
	|ИЗ
	|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	|ГДЕ
	|	ВерсииОбъектов.ДатаВерсии < &ДатаВерсии";
	
	Запрос.УстановитьПараметр("ДатаВерсии", НачалоДня(ТекущаяДата() - 86400 * Версионализации_ПериодИспользованияДней));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		наборЗаписей = РегистрыСведений.ВерсииОбъектов.СоздатьНаборЗаписей();
		наборЗаписей.Отбор.Объект.Установить(ВыборкаДетальныеЗаписи.Объект);
		наборЗаписей.Отбор.НомерВерсии.Установить(ВыборкаДетальныеЗаписи.НомерВерсии);
		наборЗаписей.Записать();
		
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
КонецПроцедуры

//<<БАА
Процедура ИнфообменHaval() Экспорт 
	
	Обработка = Обработки.БТ_ИнфообменХавал.Создать();
	Обработка.ЗаказНаряды = Истина;
	Обработка.ОбновитьКонтрагента = Истина;
	Обработка.ВыгрузитьДанные();   
	
КонецПроцедуры	

Процедура ИнфообменAvatr() Экспорт 
	
	Обработка = Обработки.БТ_ИнфообменAvatr.Создать();
	Обработка.ЗаказНаряды = Истина;
	Обработка.ОбновитьКонтрагента = Истина;
	Обработка.ВыгрузитьДанные();   
	
КонецПроцедуры

Процедура ИнфообменЧанган() Экспорт 
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	БТ_СопоставлениеПодразделенийChangan.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.БТ_СопоставлениеПодразделенийChangan КАК БТ_СопоставлениеПодразделенийChangan");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Обработка = Обработки.БТ_ИнфообменЧанган.Создать(); 
		Обработка.Подразделение = Выборка.Подразделение;
		Обработка.ОбновитьКонтрагента = Истина;
		Обработка.ЗаказНаряды = Истина;
		Обработка.ВыгрузитьДанные();
	КонецЦикла;	
	
КонецПроцедуры	

Процедура БТ_ИнфообменCRM() Экспорт 
	
	Обработка = Обработки.БТ_црмОтправитьАвтомобиль.Создать();
	Обработка.КоличествоСтраниц = 2;
	
	ДатаНачала = Справочники.CRM_НастройкаПодключения.НайтиПоКоду("000000023").Значение;
	
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		Возврат;
	КонецЕсли;	
	
	Обработка.ДатаСтартаЗагрузкиЗаказов = Дата(ДатаНачала);
	Обработка.ПолучитьРЛ();
	
КонецПроцедуры 

Функция МаркаHaval(Автомобиль) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	БТ_СопоставлениеДанныхHaval.Период КАК Период
	|ИЗ
	|	РегистрСведений.БТ_СопоставлениеДанныхHaval КАК БТ_СопоставлениеДанныхHaval
	|ГДЕ
	|	БТ_СопоставлениеДанныхHaval.Тип = &Тип
	|	И БТ_СопоставлениеДанныхHaval.Данные1С = &Данные1С");
	Запрос.УстановитьПараметр("Тип", "Бренд");
	Запрос.УстановитьПараметр("Данные1С", Автомобиль.Модель.Родитель);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции	


Процедура БТ_ОтправкаДопОборудованияАвтоCRM() Экспорт
	
	ОбработкаВыгрузки = Обработки.БТ_црмОтправитьАвтомобиль.Создать();
	
	ВидыРемонта = црмРаботаСсоединением.ВидРемонтаДоукоплектация();
	СостояниеЗН = црмРаботаСсоединением.СостояниеЗНДоукоплектация();
	
	ДатаНачалаВыгрузкиЗН = црмРаботаСсоединением.ДатаНачалаВыгрузкиДопов();
	Подразделение = црмРаботаСсоединением.ПодразделенияЦРМ();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ЗаказНаряд.Автомобиль КАК Автомобиль,
	|	МАКСИМУМ(ЕСТЬNULL(БТ_црмИзменениеСтатусаАвтомобиляСрезПоследних.СуммаДоп, 0)) КАК СуммаДоп
	|ИЗ
	|	Документ.ЗаказНаряд КАК ЗаказНаряд
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БТ_црмИзменениеСтатусаАвтомобиля.СрезПоследних КАК БТ_црмИзменениеСтатусаАвтомобиляСрезПоследних
	|		ПО ЗаказНаряд.Автомобиль = БТ_црмИзменениеСтатусаАвтомобиляСрезПоследних.Автомобиль
	|ГДЕ
	|	ЗаказНаряд.Состояние В(&Состояние)
	|	И ЗаказНаряд.Дата >= &Дата
	|	И ЗаказНаряд.ПодразделениеКомпании В(&Подразделение)
	|	И ЗаказНаряд.ВидРемонта В(&ВидРемонта)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаряд.Автомобиль");
	Запрос.УстановитьПараметр("Состояние", СостояниеЗН);
	Запрос.УстановитьПараметр("Дата", ДатаНачалаВыгрузкиЗН);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ВидРемонта", ВидыРемонта);
	
	выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СебестоимостьДопов = 0;
		СуммаДопов = 0;
		Допы = ОбработкаВыгрузки.ПолучитьДопы(Выборка.Автомобиль, СебестоимостьДопов, СуммаДопов);
		
		Если ЗначениеЗаполнено(СуммаДопов) и СуммаДопов <> Выборка.СуммаДоп Тогда
			
			ОбработкаВыгрузки.Статус = "DOP";
			ОбработкаВыгрузки.Автомобиль = Выборка.Автомобиль;
			ОбработкаВыгрузки.СебестоимостьДопов = СебестоимостьДопов;
			ОбработкаВыгрузки.СуммаДопов = СуммаДопов;
			ОбработкаВыгрузки.Допы = Допы;
			ОбработкаВыгрузки.ОтправитьАвто();
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры	

//>>БАА  

//<<БАА 13.11.2023
Функция ЗначениеКонстантногоЗначения(Наименование, Значение, НомерЗначения = "Значение1") Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Значение1
	|ИЗ
	|	Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
	|ГДЕ
	|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = &Наименование
	|	И БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение = &Значение");
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Значение", Значение);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Значение1", НомерЗначения);
	
	Выборка = ЗАпрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Значение1;
		
	КонецЕсли;	
	
КонецФункции

Функция ЗначениеКонстантногоЗначенияДляТМ(Значение, НомерЗначения = "Значение1") Экспорт
	
	Возврат ЗначениеКонстантногоЗначения("ТелемаркетингСервис", Значение, НомерЗначения);
	
КонецФункции

Функция ОпределитьНомерТО(Док) Экспорт
	НомерТО = Справочники.БТ_НомерТО.НЕТО;
	
	Для Каждого СтрокаРабот Из Док.Работы Цикл
		Если ЗначениеЗаполнено(СтрокаРабот.Работа.БТ_НомерТО) И СтрокаРабот.Работа.БТ_НомерТО <> НомерТО Тогда
			Возврат СтрокаРабот.Работа.БТ_НомерТО;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат НомерТО;
КонецФункции	


Процедура ИнфообменGeely() Экспорт
	Обработка = Обработки.БТ_ИнфообменGeely.Создать(); 
	Обработка.ЗаказНаряды = Истина;
	Обработка.ОбновитьКонтрагента = Истина;
	Обработка.ВыгрузитьДанные();	
КонецПроцедуры
//>>БАА 13.11.2023 


Процедура ИнфообменGAC() Экспорт
	Обработка = Обработки.БТ_ИнфообменGAC.Создать(); 
	Обработка.ЗаказНаряды = Истина;
	Обработка.ОбновитьКонтрагента = Истина;
	Обработка.ВыгрузитьДанные();	
КонецПроцедуры

//БИЗТЕХ КОВАЛЬ 28.03.2025 ++
Функция ВыгрузкаОстатковGeely() Экспорт
	Обраб = Обработки.ВыгрузкаОстатковВGeely.Создать();
	Обраб.ВыполнитьРегламентноеЗадание();
КонецФункции
//БИЗТЕХ КОВАЛЬ 28.03.2025 --

//КОВАЛЬ 28.11.2024 ++
Процедура ИнфообменCMExpert() Экспорт
	Обраб = Обработки.БТ_ОбменCMExpert.Создать();
	Обраб.ОбменДанными();
КонецПроцедуры
//КОВАЛЬ 28.11.2024 --                   

// БИЗТЕХ КОВАЛЬ 15.04.2025 SDK 000000844 ++
Функция ПроверитьВидРемонтаДляВыгрузки(Регистр, ВидРемонта, ДопРеквизиты=Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрПроверки.ВидРемонта КАК ВидРемонта
	|ИЗ
	|	РегистрСведений.БТ_СопоставлениеВидовРемонтаHaval КАК РегистрПроверки
	|ГДЕ
	|	РегистрПроверки.ВидРемонта = &ВидРемонта";
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"БТ_СопоставлениеВидовРемонтаHaval",Регистр);
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
//БИЗТЕХ КОВАЛЬ 15.04.2025 --

Функция НайтиОтчетКомитента(Автомобиль, ДатаПродажи3Лицу) Экспорт  //ЧалапАю БизТех 13.02.2025
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ОтчетКомитентуЗаАвтомобилиАвтомобили.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетКомитентуЗаАвтомобили.Автомобили КАК ОтчетКомитентуЗаАвтомобилиАвтомобили
	|ГДЕ
	|	ОтчетКомитентуЗаАвтомобилиАвтомобили.Ссылка.Проведен
	|	И ОтчетКомитентуЗаАвтомобилиАвтомобили.Ссылка.Дата > &Дата
	|	И ОтчетКомитентуЗаАвтомобилиАвтомобили.Автомобиль = &Автомобиль");
	Запрос.УстановитьПараметр("Дата", ДатаПродажи3Лицу);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() тогда
		Возврат Результат.Ссылка
	иначе
		Возврат Неопределено
	КонецЕсли;
КонецФункции

Функция НайдемДатуПродажи(Автомобиль, ДатаПередачиНаКомиссию) Экспорт //ЧалапАю БизТех 13.02.2025 
	ПараметрыАвто = новый Структура;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РеализацияАвтомобилейАвтомобили.Ссылка КАК Ссылка,
	|	РеализацияАвтомобилейАвтомобили.Ссылка.Дата КАК Дата,
	|	РеализацияАвтомобилейАвтомобили.Сумма КАК СуммаПродажи3Лицу
	|ИЗ
	|	Документ.РеализацияАвтомобилей.Автомобили КАК РеализацияАвтомобилейАвтомобили
	|ГДЕ
	|	РеализацияАвтомобилейАвтомобили.Автомобиль = &Автомобиль
	|	И РеализацияАвтомобилейАвтомобили.Ссылка.Проведен
	|	И РеализацияАвтомобилейАвтомобили.Ссылка.Дата > &Дата");   //дата продажи 3 лицу больше чем дата передачи на комиссию
	Запрос.УстановитьПараметр("Дата", ДатаПередачиНаКомиссию);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);  
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() тогда    
		ПараметрыАвто.Вставить("Дата",Результат.Дата);
		ПараметрыАвто.Вставить("СуммаПродажи3Лицу",Результат.СуммаПродажи3Лицу);
		Возврат ПараметрыАвто; //Результат.Дата
	иначе
		Возврат Неопределено
	КонецЕсли;  
КонецФункции

Функция НайтиОтчетКомиссионера(Автомобиль, ДатаПродажи3Лицу) Экспорт  //ЧалапАю БизТех 13.02.2025
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ОтчетКомиссионераЗаАвтомобилиАвтомобили.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетКомиссионераЗаАвтомобили.Автомобили КАК ОтчетКомиссионераЗаАвтомобилиАвтомобили
	|ГДЕ
	|	ОтчетКомиссионераЗаАвтомобилиАвтомобили.Ссылка.Проведен
	|	И ОтчетКомиссионераЗаАвтомобилиАвтомобили.Ссылка.Дата > &Дата
	|	И ОтчетКомиссионераЗаАвтомобилиАвтомобили.Автомобиль = &Автомобиль");
	Запрос.УстановитьПараметр("Дата", ДатаПродажи3Лицу);
	Запрос.УстановитьПараметр("Автомобиль", Автомобиль);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() тогда
		Возврат Результат.Ссылка
	иначе
		Возврат Неопределено
	КонецЕсли;
КонецФункции

Процедура ИнфообменЧери() Экспорт
	
	Обработка = Обработки.БТ_ИнфообменЧери.Создать();
	Обработка.Остатки = истина;
	Обработка.Сформировать();   
	
	Обработка = Обработки.БТ_ИнфообменЧери.Создать();
	Обработка.ЗаказНаряды = истина;
	обработка.ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	обработка.ДатаОкончания = КонецДня(ТекущаяДатаСеанса());
	Обработка.ВыполняетсяРегламентом = Истина;
	Обработка.Сформировать();
	
КонецПроцедуры	

Функция ВыгружаемМаркуПодразделения(КодМарки, Подразделение, Лайт = ложь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БТ_ВыгрузкаМарокАвтоПоПодразделениямCRM.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрСведений.БТ_ВыгрузкаМарокАвтоПоПодразделениямCRM КАК БТ_ВыгрузкаМарокАвтоПоПодразделениямCRM
	|ГДЕ
	|	БТ_ВыгрузкаМарокАвтоПоПодразделениямCRM.Марка.Код = &Код
	|	И БТ_ВыгрузкаМарокАвтоПоПодразделениямCRM.Подразделение = &Подразделение
	|	И БТ_ВыгрузкаМарокАвтоПоПодразделениямCRM.Лайт = &Лайт";
	
	Запрос.УстановитьПараметр("Код", КодМарки);
	Запрос.УстановитьПараметр("Подразделение", Подразделение); 
	Запрос.УстановитьПараметр("Лайт", Лайт);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();	
	
КонецФункции	

//<<БАА
Процедура ИнфообменЛайт() Экспорт
	Обработка = Обработки.БТ_ИнфообменХавал.Создать();
	Обработка.ЗаказНарядыЛайт = Истина;
	Обработка.ВыгрузитьДанные();
	
	Обработка = Обработки.БТ_ИнфообменЧанган.Создать();
	Обработка.ЗаказНарядыЛайт = Истина;
	Обработка.ВыгрузитьДанные();	
	
	Обработка = Обработки.БТ_ИнфообменGeely.Создать();
	Обработка.ЗаказНарядыЛайт = Истина;
	Обработка.ВыгрузитьДанные();
КонецПроцедуры	

Процедура ИнфообменHavalСтаврополь() Экспорт
	// БИЗТЕХ КОВАЛЬ 01.07.2025 ++
	Обработка = Обработки.БТ_ИнфообменHavalСтаврополь.Создать();
	Обработка.ОбновитьКонтрагента = Истина;
	Обработка.ВыгрузитьВсеЗаказНаряды();
	// БИЗТЕХ КОВАЛЬ 01.07.2025 --
КонецПроцедуры

// БИЗТЕХ КОВАЛЬ 11.09.2025 ++
Процедура ИнфообменBelgee() Экспорт
	Обработка = Обработки.БТ_ИнфообменBelgee.Создать();
	Обработка.ОбновитьКонтрагента = Истина;
	Обработка.ВыгрузитьВсеЗаказНаряды();
КонецПроцедуры
// БИЗТЕХ КОВАЛЬ 11.09.2025 --

// БИЗТЕХ КОВАЛЬ 11.09.2025 ++
Процедура ИнфообменHongqi() Экспорт
	Обработка = Обработки.БТ_ИнфообменHongqi.Создать();
	Обработка.ОбновитьКонтрагента = Истина;
	Обработка.ВыгрузитьВсеЗаказНаряды();
КонецПроцедуры
// БИЗТЕХ КОВАЛЬ 11.09.2025 --

// БИЗТЕХ КОВАЛЬ 10.01.2026 ++
Процедура ИнфообменJAECOO() Экспорт
	//Обработка = Обработки.БТ_ИнфообменJAECOO.Создать(); 
	//Обработка.ВыгрузитьВсеЗаказНаряды();
	//Обработка.ОбновитьКонтрагента = Истина;
	//Обработка.ВыгрузитьВсеЗаявкиНаРемонт();
КонецПроцедуры
// БИЗТЕХ КОВАЛЬ 10.01.2026 --


//<< БАА функция из формы ЗН
//Функция ПолучитьНайстрокуПоЗН(Знач ЗН)  Экспорт
//	
//	СтруктураОтчета = Новый Структура;
//	
//	Запрос = Новый Запрос;   
//	Запрос.УстановитьПараметр("Ссылка", ЗН);
//	Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	ЗаказНаряд.Ссылка КАК Ссылка,
//		|	ЗаказНаряд.Цех КАК Цех,
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение КАК ЦехИзНастроек,
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1 КАК Марка,
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение2 КАК КодДилера,
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение3 КАК ПутьВыгрузкиЗН,
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение4 КАК ПутьОбработки
//		|ИЗ
//		|	Документ.ЗаказНаряд КАК ЗаказНаряд
//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БТ_СписокКонстантныхЗначений.ТаблицаДанных КАК БТ_СписокКонстантныхЗначенийТаблицаДанных
//		|		ПО ЗаказНаряд.Цех = БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение
//		|			И ЗаказНаряд.Автомобиль.БТ_МаркаАвто = БТ_СписокКонстантныхЗначенийТаблицаДанных.Значение1
//		|ГДЕ
//		|	БТ_СписокКонстантныхЗначенийТаблицаДанных.Ссылка.Наименование = ""ОтчетПоВизитам_ЗН_Настройки""
//		|	И ЗаказНаряд.Ссылка = &Ссылка";
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	
//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//		
//		СтруктураОтчета.Вставить("ПутьФайлаЗН", 	РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ОтчетПоВизитам_АвтоматическаяНастройка_ПутьФайлаЗН"));
//	  	СтруктураОтчета.Вставить("Марка", 			ВыборкаДетальныеЗаписи.Марка);
//		СтруктураОтчета.Вставить("КодДилера", 		ВыборкаДетальныеЗаписи.КодДилера);
//		СтруктураОтчета.Вставить("ПутьФайлаЗН", 	ВыборкаДетальныеЗаписи.ПутьВыгрузкиЗН);
//		СтруктураОтчета.Вставить("ПутьФайла", 		ВыборкаДетальныеЗаписи.ПутьВыгрузкиЗН);
//		СтруктураОтчета.Вставить("ПутьОбработки", 	ВыборкаДетальныеЗаписи.ПутьОбработки);
//		
//	КонецЦикла; 
//	
//	ПериодВыгрузки = Новый СтандартныйПериод(); 
//	ПериодВыгрузки.ДатаНачала		= НачалоГода(ТекущаяДата());
//	ПериодВыгрузки.ДатаОкончания	= КонецГода(ТекущаяДата());
//	СтруктураОтчета.Вставить("Ссылка", ЗН);

//	СтруктураОтчета.Вставить("ПериодВыгрузки", ПериодВыгрузки); 
//	
//	Возврат СтруктураОтчета;
//	
//КонецФункции  

//>> БАА

// Воронка ТО
Процедура ВоронкаТООткрытьОбработку() Экспорт
	Обработки.БТ_ВоронкаТО.ПолучитьФорму().Открыть();

КонецПроцедуры 

Процедура ВоронкаТООткрытьОбработкуЗаполнения() Экспорт
 Обработки.БТ_ЗаполнениеВоронкиТО.ПолучитьФорму().Открыть();
КонецПроцедуры

Процедура ВоронкаТООткрытьСправочникНомерТО() Экспорт
	Справочники.БТ_НомерТО.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

Процедура ВоронкаТООткрытьСправочникКонстЗначений() Экспорт
	Справочники.БТ_СписокКонстантныхЗначений.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

Процедура ВоронкаТООткрытьСправочникМаркиАвто() Экспорт
	Справочники.БТ_МаркиАвтомобилей.ПолучитьФормуСписка().Открыть();
КонецПроцедуры 

Процедура ВоронкаТООткрытьРегистрВоронкаТО() Экспорт
	РегистрыСведений.БТ_ВоронкаТО.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

Процедура ВоронкаТООткрытьРегистрАктуальностьВоронкиТО() Экспорт
	РегистрыСведений.БТ_АктуальностьДанныхВоронкаТО.ПолучитьФормуСписка().Открыть();
КонецПроцедуры

Процедура ВоронкаТООткрытьРегистрЛинейкаТО() Экспорт
	РегистрыСведений.БТ_ЛинейкаТО.ПолучитьФормуСписка().Открыть();
КонецПроцедуры
